In [ ]:
### District Summary
# Create a high-level snapshot, in a DataFrame, of the district's key metrics, including the following:
# * Total schools
# * Total students
# * Total budget
# * Average math score
# * Average reading score
# * % passing math (the percentage of students who passed math)
# * % passing reading (the percentage of students who passed reading)
# * % overall passing (the percentage of students who passed math AND reading

In [1]:
import pandas as pd

In [2]:
schools_file = "Resources/schools_complete.csv"
students_file ="Resources/students_complete.csv"

In [3]:
schools_df = pd.read_csv(schools_file)
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
students_df = pd.read_csv(students_file)
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [9]:
merge_df = pd.merge(students_df, schools_df, how="left", on=["school_name","school_name"])
merge_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [16]:
merge_df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget'],
      dtype='object')

In [14]:
# Total schools
total_schools = merge_df["school_name"].nunique()
total_schools

15

In [17]:
# Total students
total_students = merge_df["Student ID"].nunique()
total_students

39170

In [18]:
# Total budget
total_budget = merge_df["budget"].sum()
total_budget

82932329558

In [19]:
# Average math score
avg_math = merge_df["math_score"].mean()
avg_math

78.98537145774827

In [20]:
#Average reading score
avg_reading = merge_df["reading_score"].mean()
avg_reading

81.87784018381414

In [ ]:
#  % passing math (the percentage of students who passed math)

In [ ]:
#  % passing reading (the percentage of students who passed reading)

In [ ]:
#  % overall passing (the percentage of students who passed math AND reading

In [ ]:
#Create chart with info